In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [4]:
data = pd.read_csv("Social_Network_Ads.csv")
data.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          1
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          1
4  15804002    Male   19            76000          0

In [5]:
data

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          1
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          1
4  15804002    Male   19            76000          0
5  15728773    Male   27            58000          0
6  15598044  Female   27            84000          0
7  15694829  Female   32           150000          1
8  15600575    Male   25            33000          0
9  15727311  Female   35            65000          1

In [6]:
data.shape

(10, 5)

## Problem Statement: Given the Gender, Age and Salary of the customer predict whether the customer are interested in the purchase of the items.

- Purchased will be the target or dependent variable
- UserID, Age, Gender, EstimatedSalary will independent variables


- This is classification problem.

# Train and test data split

### Step 1 : Seperate the data into Independent(X) and dependent variable(y)

In [7]:
## 
X = data.drop('Purchased', axis = 1)

In [8]:
X

    User ID  Gender  Age  EstimatedSalary
0  15624510    Male   19            19000
1  15810944    Male   35            20000
2  15668575  Female   26            43000
3  15603246  Female   27            57000
4  15804002    Male   19            76000
5  15728773    Male   27            58000
6  15598044  Female   27            84000
7  15694829  Female   32           150000
8  15600575    Male   25            33000
9  15727311  Female   35            65000

In [9]:
y = data['Purchased']
y

0    0
1    1
2    0
3    1
4    0
5    0
6    0
7    1
8    0
9    1
Name: Purchased, dtype: int64

### Step 2 : Split the X and y into train and test sets

In [18]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2)

In [19]:
X_train

    User ID  Gender  Age  EstimatedSalary
2  15668575  Female   26            43000
1  15810944    Male   35            20000
8  15600575    Male   25            33000
6  15598044  Female   27            84000
9  15727311  Female   35            65000
5  15728773    Male   27            58000
3  15603246  Female   27            57000
0  15624510    Male   19            19000

In [20]:
X_test

    User ID  Gender  Age  EstimatedSalary
7  15694829  Female   32           150000
4  15804002    Male   19            76000

In [13]:
y_train

9    1
3    1
4    0
2    0
6    0
1    1
7    1
5    0
Name: Purchased, dtype: int64

In [14]:
y_test

8    0
0    0
Name: Purchased, dtype: int64

### Notes:

- Train test split() perform split of X and y into 4 parts namely X_trian, X_test, y_train and y_test
- The split happens randomly. Every time you execute the cell it will give different output
- Fix the randomness of the split we have use random_state parameter.

In [27]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 42)

In [28]:
X_train

    User ID  Gender  Age  EstimatedSalary
5  15728773    Male   27            58000
0  15624510    Male   19            19000
7  15694829  Female   32           150000
2  15668575  Female   26            43000
9  15727311  Female   35            65000
4  15804002    Male   19            76000
3  15603246  Female   27            57000
6  15598044  Female   27            84000

In [29]:
X_test

    User ID Gender  Age  EstimatedSalary
8  15600575   Male   25            33000
1  15810944   Male   35            20000

In [30]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [31]:
X_train

    User ID  Gender  Age  EstimatedSalary
4  15804002    Male   19            76000
9  15727311  Female   35            65000
1  15810944    Male   35            20000
6  15598044  Female   27            84000
7  15694829  Female   32           150000
3  15603246  Female   27            57000
0  15624510    Male   19            19000
5  15728773    Male   27            58000

In [32]:
X_test

    User ID  Gender  Age  EstimatedSalary
2  15668575  Female   26            43000
8  15600575    Male   25            33000

# ML process

# Step 1: Define the problem statement

# Step 2: Import all the necessary libraries and load the data

In [33]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [36]:
#data = pd.read_csv('')
#data.head()

# Step 3: Data Cleaning, Data Wrangling and Data Preprocessing

# Step 4: Seperate X(independent variables) and y(dependent variable)

In [ ]:
X = data.drop('target column name', axis = 1)
y = data['target column name']

# Step 5: Split X and y into train and test set

In [ ]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 23)

# Step 6 : Apply ML Algorithm on X_train and y_train and convert the dataset into an ML model

# Step 7 : Prediction on X_test and store the result into y_pred

# Step 8: Compare y_pred(prediction values) and y_test(original value) to check the accuracy of the ML model